# Id Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Construction..::..Id Property
Construction Class See Also
---
Get the id of the Construction.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public string Id { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Id As String
	Get
```

Visual C++
---
```text
public:
property String^ Id {
	String^ get ();
}
```

# Remarks
This property is used to get the id of the Construction.
# See Also
Construction Class
Autodesk.Revit.DB Namespace